; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 5596)
	(= (fuel plane1) 318)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 5)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 4)
	(at plane2 city1)
	(= (capacity plane2) 8823)
	(= (fuel plane2) 1018)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 5)
	(at plane3 city1)
	(= (capacity plane3) 6118)
	(= (fuel plane3) 709)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 5)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 7)
	(at plane4 city3)
	(= (capacity plane4) 5582)
	(= (fuel plane4) 1423)
	(= (slow-burn plane4) 2)
	(= (fast-burn plane4) 4)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 5)
	(at person1 city1)
	(at person2 city1)
	(at person3 city2)
	(at person4 city3)
	(at person5 city3)
	(at person6 city3)
	(at person7 city1)
	(at person8 city3)
	(at person9 city1)
	(at person10 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 676)
	(= (distance city0 city2) 676)
	(= (distance city0 city3) 607)
	(= (distance city0 city4) 974)
	(= (distance city0 city5) 765)
	(= (distance city1 city0) 676)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 618)
	(= (distance city1 city3) 590)
	(= (distance city1 city4) 866)
	(= (distance city1 city5) 784)
	(= (distance city2 city0) 676)
	(= (distance city2 city1) 618)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 901)
	(= (distance city2 city4) 587)
	(= (distance city2 city5) 841)
	(= (distance city3 city0) 607)
	(= (distance city3 city1) 590)
	(= (distance city3 city2) 901)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 913)
	(= (distance city3 city5) 542)
	(= (distance city4 city0) 974)
	(= (distance city4 city1) 866)
	(= (distance city4 city2) 587)
	(= (distance city4 city3) 913)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 689)
	(= (distance city5 city0) 765)
	(= (distance city5 city1) 784)
	(= (distance city5 city2) 841)
	(= (distance city5 city3) 542)
	(= (distance city5 city4) 689)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city4)
	(at plane2 city5)
	(at plane4 city1)
	(at person1 city0)
	(at person2 city5)
	(at person3 city2)
	(at person4 city3)
	(at person5 city5)
	(at person6 city2)
	(at person7 city3)
	(at person8 city4)
	(at person9 city3)
	(at person10 city5)
	))

(:metric minimize (+ (* 2 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (board person5 plane4 city3)
   deleted: (at person5 city3)
   added: (in person5 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 3 of 13
2. (refuel plane2 city1)
   changed: (fuel plane2) from 1018 to 8823
   goals met: 3 of 13
3. (zoom plane2 city1 city5)
   deleted: (at plane2 city1)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 0 to 8624, (fuel plane2) from 8823 to 199
   goals met: 4 of 13
4. (board person6 plane4 city3)
   deleted: (at person6 city3)
   added: (in person6 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 4 of 13
5. (refuel plane4 city3)
   changed: (fuel plane4) from 1423 to 5582
   goals met: 4 of 13
6. (fly plane4 city3 city1)
   deleted: (at plane4 city3)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 8624 to 9804, (fuel plane4) from 5582 to 4402
   goals met: 5 of 13
7. (board person1 plane4 city1)
   deleted: (at person1 city1)
   added: (in person1 plane4)
   changed: (onboard plane4) from 2 to 3
   goals met: 5 of 13
8. (board person2 plane4 city1)
   deleted: (at person2 city1)
   added: (in person2 plane4)
   changed: (onboard plane4) from 3 to 4
   goals met: 5 of 13
9. (board person7 plane4 city1)
   deleted: (at person7 city1)
   added: (in person7 plane4)
   changed: (onboard plane4) from 4 to 5
   goals met: 5 of 13
10. (board person9 plane4 city1)
   deleted: (at person9 city1)
   added: (in person9 plane4)
   changed: (onboard plane4) from 5 to 6
   goals met: 5 of 13
11. (board person10 plane4 city1)
   deleted: (at person10 city1)
   added: (in person10 plane4)
   changed: (onboard plane4) from 6 to 7
   goals met: 5 of 13
12. (fly plane4 city1 city0)
   deleted: (at plane4 city1)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 9804 to 11156, (fuel plane4) from 4402 to 3050
   goals met: 4 of 13
13. (debark person1 plane4 city0)
   deleted: (in person1 plane4)
   added: (at person1 city0)
   changed: (onboard plane4) from 7 to 6
   goals met: 5 of 13
14. (fly plane4 city0 city3)
   deleted: (at plane4 city0)
   added: (at plane4 city3)
   changed: (total-fuel-used) from 11156 to 12370, (fuel plane4) from 3050 to 1836
   goals met: 5 of 13
15. (debark person7 plane4 city3)
   deleted: (in person7 plane4)
   added: (at person7 city3)
   changed: (onboard plane4) from 6 to 5
   goals met: 6 of 13
16. (debark person9 plane4 city3)
   deleted: (in person9 plane4)
   added: (at person9 city3)
   changed: (onboard plane4) from 5 to 4
   goals met: 7 of 13
17. (board person8 plane4 city3)
   deleted: (at person8 city3)
   added: (in person8 plane4)
   changed: (onboard plane4) from 4 to 5
   goals met: 7 of 13
18. (fly plane4 city3 city2)
   deleted: (at plane4 city3)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 12370 to 14172, (fuel plane4) from 1836 to 34
   goals met: 7 of 13
19. (debark person6 plane4 city2)
   deleted: (in person6 plane4)
   added: (at person6 city2)
   changed: (onboard plane4) from 5 to 4
   goals met: 8 of 13
20. (refuel plane4 city2)
   changed: (fuel plane4) from 34 to 5582
   goals met: 8 of 13
21. (fly plane4 city2 city5)
   deleted: (at plane4 city2)
   added: (at plane4 city5)
   changed: (total-fuel-used) from 14172 to 15854, (fuel plane4) from 5582 to 3900
   goals met: 8 of 13
22. (debark person2 plane4 city5)
   deleted: (in person2 plane4)
   added: (at person2 city5)
   changed: (onboard plane4) from 4 to 3
   goals met: 9 of 13
23. (debark person5 plane4 city5)
   deleted: (in person5 plane4)
   added: (at person5 city5)
   changed: (onboard plane4) from 3 to 2
   goals met: 10 of 13
24. (debark person10 plane4 city5)
   deleted: (in person10 plane4)
   added: (at person10 city5)
   changed: (onboard plane4) from 2 to 1
   goals met: 11 of 13
25. (fly plane4 city5 city4)
   deleted: (at plane4 city5)
   added: (at plane4 city4)
   changed: (total-fuel-used) from 15854 to 17232, (fuel plane4) from 3900 to 2522
   goals met: 11 of 13
26. (debark person8 plane4 city4)
   deleted: (in person8 plane4)
   added: (at person8 city4)
   changed: (onboard plane4) from 1 to 0
   goals met: 12 of 13
27. (fly plane4 city4 city1)
   deleted: (at plane4 city4)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 17232 to 18964, (fuel plane4) from 2522 to 790
   goals met: 13 of 13
